src/InformationRegisters/ФорматыАссортиментаПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФорматыАссортиментаПодразделений</Name>
			<Comment>Форматы ассортимента подразделений</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Формат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыКатегорий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ФорматыАссортиментаПодразделений/Ext/RecordSetModule.bsl
// Модуль набора записей регистра "Ограничение ассортимента подразделения"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОписаниеПеременных

Перем ДокументОбъект Экспорт;               // Документ объект
Перем ПодразделениеКомпании Экспорт;		// Подразделение компании
Перем ДатаНачалаДействия Экспорт;    // Дата изменения ассортимента
Перем РезультатЗапросаПоТоварам Экспорт;	// РезультатЗапроса или ТаблицаЗначений.
Перем ОперацияСАссортиментом Экспорт;       // Операция с ассортиментом

// ускоряющие переменные
Перем ВалютаДокумента, КурсДокумента, ВалютаРеглУчета, КурсРеглВалюты;

#КонецОбласти

// Функция установки ассортимента
Функция УстановитьФорматыПодразделения() Экспорт
	Если ТипЗнч(РезультатЗапросаПоТоварам)=Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам.Выгрузить();
	КонецЕсли;
	
	// ускоряющие переменные
	ВалютаДокумента	= ДокументОбъект.ВалютаДокумента;
	КурсДокумента	= ДокументОбъект.КурсДокумента;
	ВалютаРеглУчета	= Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	КурсРеглВалюты	= РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРеглУчета, ДокументОбъект.МоментВремени()).Курс;
	
	Для Каждого СтрокаТовар Из РезультатЗапросаПоТоварам Цикл
		НоваяЗапись	= Добавить();
		НоваяЗапись.Период					= ДатаНачалаДействия;
		НоваяЗапись.Регистратор				= ДокументОбъект.Ссылка;
		НоваяЗапись.ПодразделениеКомпании	= ПодразделениеКомпании;
		НоваяЗапись.Номенклатура			= СтрокаТовар.Номенклатура;
		НоваяЗапись.Формат					= СтрокаТовар.Формат;
	КонецЦикла;
	
	// скинем некоторые переменные
	РезультатЗапросаПоТоварам = Неопределено;
	// убиваем циклическую ссылку
	ДокументОбъект = Неопределено;
	
	Возврат Истина;
КонецФункции



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для формирования наименования/кода нового элемента.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи объекта.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередЗаписью(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ПередЗаписью(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли
